SOAP-Spring/countrysoap/bad-request.xml

<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE a [<!ENTITY b "Spain">]>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
  <soapenv:Header/>
  <soapenv:Body>
    <gs:getCountryRequest>
    <gs:name>&b;</gs:name>
    </gs:getCountryRequest>
  </soapenv:Body>
</soapenv:Envelope>
